# Создать список (библиотека книг), состоящий из словарей (книги). Словари должны содержать как минимум 5 полей
# (например, номер, название, год издания...). В список добавить хотя бы 10 словарей.
# Конструкция вида:
# library = [{"id" : 123456, "title" : "Война и мир", "author" : "Толстой",...} , {...}, {...}, ...]
# Реализовать функции:
# – вывода информации о всех книгах;                                    info()
# – вывода информации о книге по введенному с клавиатуры номеру;        getBookById()
# – вывода количества книг, старше введённого года;                     olderThanCount()
# – обновлении всей информации о книге по введенному номеру;            updateBook()
# – удалении книги по номеру.                                           deleteBook()
# Провести тестирование функций.


library = [
    {
        'id': 0,
        'title': 'Повесть о двух городах',
        'author': 'Чарльз Диккенс',
        'age': 1859
    },
    {
        'id': 1,
        'title': 'Маленький принц',
        'author': 'Antoine de Saint-Exupéry',
        'age': 1943
    },
    {
        'id': 2,
        'title': 'Гарри Поттер и философский камень',
        'author': 'Джоан Роулинг',
        'age': 1997
    },
    {
        'id': 3,
        'title': 'А потом не было ни одной',
        'author': 'Агата Кристи',
        'age': 1939
    },
    {
        'id': 4,
        'title': 'Сон о красной палате',
        'author': 'Цао Сюэцинь',
        'age': 1791
    },
    {
        'id': 5,
        'title': 'Хоббит',
        'author': 'Дж. Р. Р. Толкин',
        'age': 1937
    },
    {
        'id': 6,
        'title': 'Лев, Ведьма и Шкаф',
        'author': 'К. С. Льюис',
        'age': 1950
    },
    {
        'id': 7,
        'title': 'Она: История приключений',
        'author': 'Х. Райдер Хаггард',
        'age': 1887
    },
    {
        'id': 8,
        'title': 'Варди Вала Гунда',
        'author': 'Вед Пракаш Шарма',
        'age': 1992
    },
{
        'id': 9,
        'title': 'Код Да Винчи',
        'author': 'Дэн Браун',
        'age': 2003
    },
]


def info():
    print('------------------------------------------------------')
    for i in library:
        print(f"[{i['id']}]: {i['author']} - {i['title']} ({i['age']}г.)")
        print('------------------------------------------------------')


def getBookById():
    id = int(input('Введите id книги: '))
    for i in library:
        if(i['id'] == id):
            print(f"[{i['id']}]: {i['author']} - {i['title']} ({i['age']}г.)")
            return
    print(f'Не найдено книги по id [{id}]')


def olderThanCount():
    y = int(input('Год: '))
    a = 0
    for i in library:
        if(i['age'] < y): a+=1
    print(f'Найдено {a} книг, год которых старше {y}')


def updateBook():
    id = int(input('id корректируемой книги: '))
    for i in library:
        if(i['id'] == id):
            i['author'] = input('Новый автор книги: ')
            i['title'] = input('Новое название книги: ')
            i['age'] = int(input('Новый год книги: '))
            return
    print(f'Не найдено книги по id [{id}]')


def deleteBook():
    id = int(input('id удаляемой книги: '))
    for i in library:
        if (i['id'] == id):
            library.remove(i)
            return
    print(f'Не найдено книги по id [{id}]')