from Discipline import *
from typing import *

class Practice(Discipline):
    def __init__(self, название, семестр, кафедра, вид_практики, руководитель_практики, тематика_практики : List):
        super().__init__(название, семестр, кафедра)
        self.вид_практики = вид_практики
        self.руководитель_практики = руководитель_практики
        self.тематика_практики = тематика_практики

    def изменить_руководителя(self, руководитель):
        self.руководитель_практики = руководитель

    def добавить_тематику(self, тематика):
        self.тематика_практики.append(тематика)

    def удалить_тематику(self, тематика):
        self.тематика_практики.remove(тематика)

    def изменить_тематику(self, тематика, тематика_изм):
        index = self.тематика_практики.index(тематика)
        try:
            self.тематика_практики[index] = тематика_изм
        except:
            print('Не удалось найти тематику')

    def __str__(self):

        return f'название: {self.название}\n' \
               f'вид практики: {self.вид_практики}\n' \
               f'семестр: {self.семестр}\n' \
               f'кафедра: {self.кафедра}\n' \
               f'руководитель: {self.руководитель_практики}\n' \
               f'Тематики: {" ,".join(self.тематика_практики)}\n'
